html/clojure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Clojure</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">Clojure</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Rich Hickey访谈：Clojure的优势在哪里？</a></li>
</ul>
</div>
</div>
<hr  />
<ul class="org-ul">
<li><a href="http://clojure.org/">http://clojure.org/</a>
</li>
<li><a href="http://clojure.github.com/clojure/">http://clojure.github.com/clojure/</a>
</li>
<li><a href="http://clojure-doc.org/">http://clojure-doc.org/</a>
</li>
<li>Clojure made simple <a href="http://clojure.jr0cket.co.uk/">http://clojure.jr0cket.co.uk/</a>
</li>
<li>Clojure - Functional Programming for the JVM <a href="http://java.ociweb.com/mark/clojure/article.html">http://java.ociweb.com/mark/clojure/article.html</a>
</li>
<li>Clojure Handbook (by jamesqiu) <a href="http://qiujj.com/static/clojure-handbook.html">http://qiujj.com/static/clojure-handbook.html</a>
</li>
<li>technomancy/leiningen · GitHub <a href="https://github.com/technomancy/leiningen#readme">https://github.com/technomancy/leiningen#readme</a>
</li>
<li>Clojars <a href="https://clojars.org/">https://clojars.org/</a> Clojars is a dead easy community repository for open source Clojure libraries.
</li>
<li>technomancy/leiningen · GitHub <a href="https://github.com/technomancy/leiningen">https://github.com/technomancy/leiningen</a> clojure自动构建工具
<ul class="org-ul">
<li><a href="http://github.com/downloads/clojure/clojure/clojure-1.2.0.zip">http://github.com/downloads/clojure/clojure/clojure-1.2.0.zip</a>
</li>
<li><a href="http://github.com/downloads/clojure/clojure-contrib/clojure-contrib-1.2.0.zip">http://github.com/downloads/clojure/clojure-contrib/clojure-contrib-1.2.0.zip</a>
</li>
</ul>
</li>
</ul>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Rich Hickey访谈：Clojure的优势在哪里？</h2>
<div class="outline-text-2" id="text-1">
<p>
下面文字摘抄自《七周七语言》
</p>

<blockquote>
<p>
Bruce：很多Lisp方言在获取更广泛的成功方面都败下阵来，Clojure如何能成功？
</p>

<p>
Rich：这是个非常重要的问题！我不否认主要Lisp方言（Scheme和Common Lisp）已经完成了它们的使命。。Scheme的目的是通过一个很精炼的语言来捕捉计算的本质，而Common Lisp则致力于标准化科研中所用到的各种Lisp方言。但它们都没能够作为一种实用工具成为业界开发者所使用的通用编程语言，实际上这也不是它们的设计目标。
</p>

<p>
另一方面，，Clojure是设计用来作为一种实用工具，为业界的开发者所使用的一种通用生产性编程语言，为此在传统的Lisp上加入了这些新的目标。它更适于团队开发，擅长和其他语言相互协作，而且还解决了一些传统的Lisp问题。
</p>

<p>
Bruce：为什么Clojure在团队开发中表现更好？
</p>

<p>
Rich：某种意义上说，有些Lisp最关心的是如何挖掘个体开发者的最大力量，而Clojure认为开发是一项团队活动。例如，它不支持用户自定义的宏读取器，因为这样做会导致代码被写成一堆互不兼容的微方言。
</p>

<p>
Bruce：为什么Clojure选择运行在现有的虚拟机上？
</p>

<p>
Rich：现如今，全世界已经积累了大量有价值的、使用其他语言编写的代码，而这种情况在Lisp刚被开发出来的那个年代还没出现。因此在今天能够调用其他语言和被其他语言调用的能力必不可少，尤其是在JVM和CLR上。
</p>

<p>
剥离宿主操作系统的标准多语言平台，在在Lisp被发明的那个年代几乎不存在。整个业界比以前大出好几个量级，事实标准也已经诞生。从技术角度讲，类似复杂、精密的垃圾收集器，以及HotSpot这样的动态编译器，都是支持重用核心技术的技术层工具。因此，Clojure更强调语言在平台上（language-on-platform），而非语言即平台（language-is-platform）。
</p>
</blockquote>
</div>
</div>
</div>
</body>
</html>
